Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/mailman-tm.tmx
Source language: en
Languages: ca_es

source: Cannot read both digest and normal members from standard input.
ca_es: No puc llegir als subscriptors regulars i als no regulars des de l'entrada estàndard.

source: No such list: %(listname)s
ca_es: La llista no existeix: %(listname)s

source: Nothing to do.
ca_es: Res per fer.

source: Rebuild a list's archive. Use this command to rebuild the archives for a mailing list. You may want to do this if you edit some messages in an archive, or remove some messages from an archive. Usage: %(PROGRAM)s [options] <listname> [<mbox>] Where options are: -h / --help Print this help message and exit. -q / --quiet Make the archiver output less verbose. --wipe First wipe out the original archive before regenerating. You usually want to specify this argument unless you're generating the archive in chunks. -s N --start=N Start indexing at article N, where article 0 is the first in the mbox. Defaults to 0. -e M --end=M End indexing at article M. This script is not very efficient with respect to memory management, and for large archives, it may not be possible to index the mbox entirely. For that reason, you can specify the start and end article numbers. Where <mbox> is the path to a list's complete mbox archive. Usually this will be some path in the archives/private directory. For example: %% bin/arch mylist archives/private/mylist.mbox/mylist.mbox <mbox> is optional. If it is missing, it is calculated.
ca_es: Reconstruir l'arxiu d'una llista. Fes servir aquesta ordre per reconstruir els fitxers d'una llista. Voldràs der això si edites o elimines algun missatge d'un arxiu. Forma d'ús: %(PROGRAM)s [opcions] <listname> [<mbox>] On les opcions són: -h / --help Mostra aquest missatge i surt. -q / --quiet fer la sortida silenciosa. --wipe Eliminar l'arxiu original abans de regenerar-lo. Normalment voldràs especificar aquest argument a no ser que estiguis generant l'arxiu a trossos. -s N --start=N Començar a indexar per l'article N, on 0 es el primer a mbox. per defecte això està a 0. -e M --end=M Acabar d'indexar a l'article M. Aquest script no és molt eficient amb l'administració de memòria , i per arxius grans, no serà possible indexar el mbox complet. Per aquesta raó, pots especificar la opció per a començar i acabar a un nombre donat d'article. On <mbox> és la ruta is a l'arxiu mbox de la llista. Normalment això serà una ruta al directori archives/private . Ex.: %% bin/arch mylist archives/private/mylist.mbox/mylist.mbox <mbox> és opcional. Si no és especificat es calcularà.

source: listname is required
ca_es: El nom de la llista és requerit

source: No such list "%(listname)s" %(e)s
ca_es: La llista no existeix "%(listname)s" %(e)s

source: Cannot open mbox file %(mbox)s: %(msg)s
ca_es: No es pot obrir el fitxer mbox %(mbox)s: %(msg)s

source: Fix the MM2.1b4 archives. Usage: %(PROGRAM)s [options] file ... Where options are: -h / --help Print this help message and exit. Only use this to `fix' some archive database files that may have gotten written in Mailman 2.1b4 with some bogus data. Use like this from your $PREFIX directory %% %(PROGRAM)s `grep -l _mlist archives/private/*/database/*-article` (note the backquotes are required) You will need to run `bin/check_perms -f' after running this script.
ca_es: Fixar els fitxers MM2.1b4. Forma d'ús: %(PROGRAM)s [opcions] fitxer ... On les opcions són: -h / --help Mostra aquest missatge i surt. Només hi ha que fer servir això per `fixar' alguns fitxers de bases de dades que hagin estat escrits amb Mailman 2.1b4 amb informació errònia. Fes-lo servir aixi desde el teu $PREFIX directori %% %(PROGRAM)s `grep -l _mlist archives/private/*/database/*-article` (es requereixen les cometes) Necessitaràs executar `bin/check_perms -f' després d'executar aquest script.

source: Change a list's password. Prior to Mailman 2.1, list passwords were kept in crypt'd format -- usually. Some Python installations didn't have the crypt module available, so they'd fall back to md5. Then suddenly the Python installation might grow a crypt module and all list passwords would be broken. In Mailman 2.1, all list and site passwords are stored in SHA1 hexdigest form. This breaks list passwords for all existing pre-Mailman 2.1 lists, and since those passwords aren't stored anywhere in plain text, they cannot be retrieved and updated. Thus, this script generates new passwords for a list, and optionally sends it to all the owners of the list. Usage: change_pw [options] Options: --all / -a Change the password for all lists. --domain=domain -d domain Change the password for all lists in the virtual domain `domain'. It is okay to give multiple -d options. --listname=listname -l listname Change the password only for the named list. It is okay to give multiple -l options. --password=newpassword -p newpassword Use the supplied plain text password `newpassword' as the new password for any lists that are being changed (as specified by the -a, -d, and -l options). If not given, lists will be assigned a randomly generated new password. --quiet / -q Don't notify list owners of the new password. You'll have to have some other way of letting the list owners know the new password (presumably out-of-band). --help / -h Print this help message and exit.
ca_es: Canviar la contrasenya d'una llista. Abans del Mailman 2.1, les contrasenyes de les llistes eren desades en format crypt'd -- normalment. Algunes instal·lacions de Python no tenien el modul crypt, i per això fallaven i feien servir md5. Després la instal·lació de Python podia generar un modul crypt i les contrasenyes de les llistes fallarien . Al Mailman 2.1, totes les contrasenyes de les llistes i del site són SHA1 hexdigest Això trenca les contrasenyes de llistes existens pre-Mailman 2.1, i com aquestes contrasenyes no es desen en text pla, no es poden actualitzar.. Per això, aquest script genera noves contrasenyes per una llista i opcionalmentla envia al seu amo. Forma d'ús: change_pw [opcions] Opcions: --all / -a Canviar la contrasenya per a totes les llistes. --domain=domain -d domain Canviar la contrasenya per a totes les llistes del domini virtual `domain'. Es poden donar múltiples opcions -d --listname=listname -l listname Canviar la contrasenya només per la llista especificada.. Es poden donar múltiples opcions -l. --password=newpassword -p newpassword Fer servir la contrasenya en text pla especificada `newpassword' com a nova contrasenya per a totes les llistes afectades pel canvi.(amb les opcions -a, -d, i -l). Si no s'especfica, s'assiganarà una nova contrasenya generada aleatoriament. --quiet / -q No notificar als amos de la llista de la nova contrasenya. Hauras de tenir alguna altra forma de fer-lis saber la nova contrasenya. (presumtament out-of-band). --help / -h Mostra aquest missatge d'ajuda i surt.

source: Bad arguments: %(strargs)s
ca_es: Arguments erronis: %(strargs)s

source: Empty list passwords are not allowed
ca_es: Les contrasenyes buides per les llistes no estan permeses

source: New %(listname)s password: %(notifypassword)s
ca_es: Contrasenya nova per a %(listname)s: %(notifypassword)s

source: Your new %(listname)s list password
ca_es: La contrasenya nova de %(listname)s

source: The site administrator at %(hostname)s has changed the password for your mailing list %(listname)s. It is now %(notifypassword)s Please be sure to use this for all future list administration. You may want to log in now to your list and change the password to something more to your liking. Visit your list admin page at %(adminurl)s
ca_es: L'administrador de %(hostname)s ha canviat la vostra contrasenya per a la vostra llista de correu %(listname)s. Ara és %(notifypassword)s Si us plau, assegurat de fer servir aquesta contrasenya la pròxima vegada que administris la llista. Pot ser voleu entrar ara a la vostra llista i canviar la contrasenya. Visita la pàgina d'administració de la llista a %(adminurl)s

source: Check a list's config database file for integrity. All of the following files are checked: config.pck config.pck.last config.db config.db.last config.safety It's okay if any of these are missing. config.pck and config.pck.last are pickled versions of the config database file for 2.1a3 and beyond. config.db and config.db.last are used in all earlier versions, and these are Python marshals. config.safety is a pickle written by 2.1a3 and beyond when the primary config.pck file could not be read. Usage: %(PROGRAM)s [options] [listname [listname ...]] Options: --all / -a Check the databases for all lists. Otherwise only the lists named on the command line are checked. --verbose / -v Verbose output. The state of every tested file is printed. Otherwise only corrupt files are displayed. --help / -h Print this text and exit.
ca_es: Comprova la integritat de la base de dades de configuració d'una llista. Es comproven tots els fitxers següents: config.pck config.pck.last config.db config.db.last config.safety No passa res si falta algun d'aquests fitxers. config.pck i config.pck.last són versions pickletades del fitxer de configuració de 2.1a3 i posteriors. config.db i config.db.last es fan servir a totes les versions anteriors i són fitxers marshals de Python. config.safety és un pickle escrit per a 2.1a3 i posteriors quan no es podia llegir el fitxer config.pck principal. Forma d'ú: %(PROGRAM)s [opcions] [listname [listname ...]] Options: --all / -a Comprovar les bases de dades de totes les llistes. En cas contrari, nomes es comprova la llista donada. --verbose / -v Es mostra l'estat de tots els fitxers comprovats. --help / -h Mostra aquest missatge i surt.

source: No list named:
ca_es: No hi ha cap llista amb el nom:

source: List:
ca_es: Llista:

source: %(file)s: okay
ca_es: %(file)s: correcte

source: checking gid and mode for %(path)s
ca_es: comprovació del GID i del mode de %(path)s

source: %(path)s bad group (has: %(groupname)s, expected %(MAILMAN_GROUP)s)
ca_es: %(path)s grup erroni (té: %(groupname)s, s'esperava %(MAILMAN_GROUP)s)

source: directory permissions must be %(octperms)s: %(path)s
ca_es: els permisos de directori han de ser %(octperms)s: %(path)s

source: source perms must be %(octperms)s: %(path)s
ca_es: els permisos dels fonts han de ser %(octperms)s: %(path)s

source: article db files must be %(octperms)s: %(path)s
ca_es: Els permisos dels fitxers db han de ser %(octperms)s: %(path)s

source: checking mode for %(prefix)s
ca_es: comprovació del mode per %(prefix)s

source: WARNING: directory does not exist: %(d)s
ca_es: AVÍS: no existeix el directori: %(d)s

source: directory must be at least 02775: %(d)s
ca_es: el directori ha de ser almenys 02775: %(d)s

source: checking perms on %(private)s
ca_es: comprovació dels permisos de %(private)s

source: %(private)s must not be other-readable
ca_es: %(private)s no ha de ser de lectura per a altres usuaris

source: Warning: Private archive directory is other-executable (o+x). This could allow other users on your system to read private archives. If you're on a shared multiuser system, you should consult the installation manual on how to fix this.
ca_es: Avís: el directori dels arxius privats és executable per als altres usuaris (o+x). Això pot causar que altres usuaris del vostre sistema puguin llegir els arxius privats. Si sou en un sistema multiusuari compartit, hauríeu de consultar-ne el manual per a esbrinar com solucionar aquesta situació.

source: mbox file must be at least 0660:
ca_es: El fitxer mbox ha de ser almenys 0660:

source: %(dbdir)s "other" perms must be 000
ca_es: els permisos de %(dbdir)s "other" han de ser 000

source: checking cgi-bin permissions
ca_es: comprovant permisos de cgi-bin

source: checking set-gid for %(path)s
ca_es: comprovant permisos de set-gid per %(path)s

source: %(path)s must be set-gid
ca_es: %(path)s ha de ser set-gid

source: checking set-gid for %(wrapper)s
ca_es: comprovant permisos de set-gid per %(wrapper)s

source: %(wrapper)s must be set-gid
ca_es: %(wrapper)s ha de ser set-gid

source: checking permissions on %(pwfile)s
ca_es: comprovant permisos de %(pwfile)s

source: %(pwfile)s permissions must be exactly 0640 (got %(octmode)s)
ca_es: els permisos de %(pwfile)s han de ser exactament 0640 (got %(octmode)s)

source: checking permissions on list data
ca_es: comprovant permisos a la informació de la llista

source: checking permissions on: %(path)s
ca_es: comprovant permisos a: %(path)s

source: file permissions must be at least 660: %(path)s
ca_es: els permisos dels fitxers han de ser almenys 660: %(path)s

source: No problems found
ca_es: No s'han trobat problemes

source: Problems found:
ca_es: Problemes trobats:

source: Re-run as %(MAILMAN_USER)s (or root) with -f flag to fix
ca_es: Re-executa com %(MAILMAN_USER)s (o root) amb la senyal -f per a fixar

source: Clean up an .mbox archive file. The archiver looks for Unix-From lines separating messages in an mbox archive file. For compatibility, it specifically looks for lines that start with "From " -- i.e. the letters capital-F, lowercase-r, o, m, space, ignoring everything else on the line. Normally, any lines that start "From " in the body of a message should be escaped such that a > character is actually the first on a line. It is possible though that body lines are not actually escaped. This script attempts to fix these by doing a stricter test of the Unix-From lines. Any lines that start "From " but do not pass this stricter test are escaped with a > character. Usage: cleanarch [options] < inputfile > outputfile Options: -s n --status=n Print a # character every n lines processed -q / --quiet Don't print changed line information to standard error. -n / --dry-run Don't actually output anything. -h / --help Print this message and exit
ca_es: netejar un fitxer .mbox. L'arxiu cerca línies From-Unix separant missatges en un fitxer mbox. A causa de la compatibilitat, busca específicament línies que comencen amb "From" -- Per ex. les lletres F en majúscules, r minúscules, o, m, espai en blanc, ignorant qualsevol cosa més en la mateixa línia. Normalment, qualsevol de les línies que comencin amb "From" en el cos del missatge haurien d'estar escapades degut al fet que un caràcter > és el primer que apareix a la línia. És possible que les línies no es trobin escapades. Aquest sript intenta corregir això fent una comprovació estricta de les línies From-Unix. Qualsevol línia que comenci amb "From" però que no passi aquest test estricte s'escapa amb un caràcter >. Forma d'ús: cleanarch [opcions] < inputfile > outputfile Opcions: -s n --status=n Mostra un caràcter # cada n línies processades. -q / --quiet Don't print changed line information to standard error. -n / --dry-run No mostrar res. -h / --help Mostra aquest missatge i surt.

source: Unix-From line changed: %(lineno)d
ca_es: Línia From de Unix canviada: %(lineno)d

source: Bad status number: %(arg)s
ca_es: Número d'estat erroni: %(arg)s

source: %(messages)d messages found
ca_es: %(messages)d missatges trobats

source: Clone a member address. Cloning a member address means that a new member will be added who has all the same options and passwords as the original member address. Note that this operation is fairly trusting of the user who runs it -- it does no verification to the new address, it does not send out a welcome message, etc. The existing member's subscription is usually not modified in any way. If you want to remove the old address, use the -r flag. If you also want to change any list admin addresses, use the -a flag. Usage: clone_member [options] fromoldaddr tonewaddr Where: --listname=listname -l listname Check and modify only the named mailing lists. If -l is not given, then all mailing lists are scanned from the address. Multiple -l options can be supplied. --remove -r Remove the old address from the mailing list after it's been cloned. --admin -a Scan the list admin addresses for the old address, and clone or change them too. --quiet -q Do the modifications quietly. --nomodify -n Print what would be done, but don't actually do it. Inhibits the --quiet flag. --help -h Print this help message and exit. fromoldaddr (`from old address') is the old address of the user. tonewaddr (`to new address') is the new address of the user.
ca_es: Clonar una adreça de membre. Clonar una adreça de membre vol dir que s'afegirà un nous membre amb les mateixes opcions i contrasenyes que el membre original de la adreça. Aquesta opció no envia verificació a la nova adreça ni envia un missatge de benvinguda, etc. La subscripció de membre existent normalment no es modifica de cap manera Si voleu eliminar l'adreça antiga, fes servir la senyal -r. Si a més voleu canviar l'adreça del admin de la llista fese servir la senyal -a. Forma d'ús: clone_member [opcions] fromoldaddr tonewaddr On: --listname=listname -l listname Comprovar i modificar només les llistes donades.Si -l no s'especifica, totes les llistes són escanejades. Es poden especificar múltiples opcions -l. --remove -r Eliminar l'adreça antiga de la llista de correu després de clonarla. --admin -a Escanejar lles adreces dels admins de la llista i clonarles o canviarles. --quiet -q Fer les modificacions en silenci. --nomodify -n Mostrar el que es farà però no fer res. --help -h Mostra aquest missatge d'ajuda i surt. fromoldaddr («de l'adreça antiga») és l'adreça antiga de l'usuari. tonewaddr («a l'adreça nova») és l'adreça nova de l'usuari.

source: processing mailing list:
ca_es: processant llista de correu:

source: scanning list owners:
ca_es: escanejant els amos de la llista:

source: new list owners:
ca_es: Nous amos de la llista:

source: (no change)
ca_es: (no hi ha canvis)

source: address not found:
ca_es: adreça no trobada:

source: clone address added:
ca_es: adreça clonada afegida:

source: clone address is already a member:
ca_es: l'adreça clonada ja és membre:

source: original address removed:
ca_es: Adreça original eliminada:

source: Not a valid email address: %(toaddr)s
ca_es: No és una adreça vàlida: %(toaddr)s

source: Error opening list "%(listname)s", skipping. %(e)s
ca_es: Error obrint la llista "%(listname)s", saltant. %(e)s

source: Configure a list from a text file description. Usage: config_list [options] listname Options: --inputfile filename -i filename Configure the list by assigning each module-global variable in the file to an attribute on the list object, then saving the list. The named file is loaded with execfile() and must be legal Python code. Any variable that isn't already an attribute of the list object is ignored (a warning message is printed). See also the -c option. A special variable named `mlist' is put into the globals during the execfile, which is bound to the actual MailList object. This lets you do all manner of bizarre thing to the list object, but BEWARE! Using this can severely (and possibly irreparably) damage your mailing list! --outputfile filename -o filename Instead of configuring the list, print out a list's configuration variables in a format suitable for input using this script. In this way, you can easily capture the configuration settings for a particular list and imprint those settings on another list. filename is the file to output the settings to. If filename is `-', standard out is used. --checkonly -c With this option, the modified list is not actually changed. Only useful with -i. --verbose -v Print the name of each attribute as it is being changed. Only useful with -i. --help -h Print this help message and exit. The options -o and -i are mutually exclusive.
ca_es: Configurar una llista a partir d'un fitxer de text de descripció. Forma d'ús: config_list [opcions] listname Opcions: --inputfile filename -i filename Configura la llista assignant cada variable de modul-global continguda en el fitxer a un atribut de l'objecte llista, guardant els canvis a continuació. El fitxer especificat es carrega amb execfile() i té que contenir codi Python vàlid. Qualsevol variable que no sigui un atribut vàlid d'una llista s'ignorarà (imprimint un missatge d'avís). Vegi també l'opció -c. Una variable especial `mlist' es posa en l'àmbit global durant l'execució de execfile, que s'associa a la llista actual. Això li permet fer tot tipus de coses rares a la llista, però ¡VAGI AMB COMPTE! fer servir això pot danyar seriosament (i possiblement irreversiblement) la seva llista de distribució. --outputfile filename -o filename En comptes de configurar la llista, imprimeix les variables de configuració de la llista en un format adequat per a usar-lo com entrada a aquest script. D'aquesta manera, pot guardar les opcions de configuració d'una llista i usar-les per a configurar altra llista. Les opcions de configuració es guarden a `filename'. Si filename és `-', la sortida del programa s'envia a la sortida estàndard. --checkonly -c Amb aquesta opció la llista no és canviada. Només es útil amb lópció -i. --verbose -v Mostrar el nom dels atributs aixi com es van canviant. Només útil amb l'opció -i. --help -h Mostra aquest missatge i surt. Les opcions -o i -i són mutuament exclusives.

source: # -*- python -*- # -*- coding: %(charset)s -*- ## "%(listname)s" mailing list configuration settings ## captured on %(when)s
ca_es: # -*- python -*- # -*- coding: %(charset)s -*- ## Paràmetres de configuració de la llista de correu «%(listname)s» ## registrats el %(when)s

source: options
ca_es: opcions

source: legal values are:
ca_es: els valors permesos són:

source: attribute "%(k)s" ignored
ca_es: s'ha ignorat l' atribut «%(k)s»

source: attribute "%(k)s" changed
ca_es: ha canviat l'atribut «%(k)s»

source: Non-standard property restored: %(k)s
ca_es: Propietat no estàndard restaurada: %(k)s

source: Invalid value for property: %(k)s
ca_es: Valor erroni per a la propietat: %(k)s

source: Bad email address for option %(k)s: %(v)s
ca_es: Adreça de correu electrònic errònia per a l'opció %(k)s: %(v)s

source: Only one of -i or -o is allowed
ca_es: Només una de les opcions -i o -o es permesa

source: One of -i or -o is required
ca_es: una de les opcions -i o -o és requerida

source: List name is required
ca_es: Nom de la llista és requerit

source: Convert a list's interpolation strings from %-strings to $-strings. This script is intended to be run as a bin/withlist script, i.e. % bin/withlist -l -r convert <mylist>
ca_es: Convertir les cadenes d'interpolació d'una llista de %-strings a $-strings. Aquest script està fet per executarse com un script bin/withlist script, ex. % bin/withlist -l -r convert <mylist>

source: Saving list
ca_es: Desant llista

source: Discard held messages. Usage: discard [options] file ... Options: --help / -h Print this help message and exit. --quiet / -q Don't print status messages.
ca_es: Descarta els missatges retinguts. Forma d'ús: discard [opcions] fitxer ... Opcions: --help / -h Mostra aquest missatge i surt. --quiet / -q No mostris els missatges d'estat.

source: Ignoring non-held message: %(f)s
ca_es: S'ignorarà el missatge no retingut: %(f)s

source: Ignoring held msg w/bad id: %(f)s
ca_es: S'ignorarà el missatge retingut que té una id incorrecta: %(f)s

source: Discarded held msg #%(id)s for list %(listname)s
ca_es: S'ha descartat el missatge retingut #%(id)s de la llista %(listname)s
